Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །སྐྱེས་བུ་ལྷ་ཡི་སྲས་པོ་ཁྱོད་ལ་དབུལ།
en: I offer to you, a divine man.

source: །བསྐལ་པ་རྒྱ་མཚོར་སྤྱོད་པ་མཛད་པའི་ཚེ། །སྐྱེ་བོ་སློང་བ་རྣམས་ལ་དགྱེས་པར་གསོལ།
en: When you practice the conduct in an ocean of kalpas, I pray you use it to please the supplicants.

source: །སེམས་ཅན་ཀུན་ལ་ཐུགས་རྗེ་མཐའ་ཡས་པ།
en: ‘You developed endless compassion for all beings

source: །བསྐྱེད་དེ་སེམས་ཅན་རྒྱ་མཆོ་བསྡུ་སླད་དུ།
en: In order to gather together an ocean of beings.

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་ཁྱོད་བཞུགས་པས།
en: You are set on attaining supreme, perfect enlightenment,

source: །དེ་སླད་བདག་ཀྱང་ཐུགས་རྗེས་གཟུང་བ་མཛོད།
en: So from now on hold me too in your compassion. “ ‘I desire you, the supreme being, as a husband,

source: །ལོགས་སྤྱོད་དོན་དང་ནོར་གྱི་དོན་མ་ལགས།
en: Not for the sake of possessions, not for the sake of wealth,

source: །འདོད་སྤྱོད་དགའ་བ་བསྐྱེད་པའི་དོན་སླད་དུ། །སེམས་ཅན་མཆོག་ཁྱོད་ཁྱོར་འཚལ་མ་ལགས་ཀྱི།
en: And not for the sake of enjoying sensual pleasures

source: །ཁྱོད་དང་སྦྱོང་པ་འཐུན་པར་སྤྱད་སླད་དུའོ།
en: But in order to practice the same conduct as you. “ ‘The way in which you look upon the world

source: །སྤྱན་གསལ་མཛེས་ཤིང་བྱམས་པའི་ཐུགས་མངའ་བ། །ཁྱོད་ནི་འཇིག་རྟེན་གཟིགས་པ་ཅི་ཚུལ་ལགས།
en: Is with clear, beautiful eyes and a mind of love,

source: །ཐུགས་རྗེ་ཆེ་ཡི་འདོད་ཆགས་ཐུགས་མི་མངའ།
en: With great compassion and a mind free of passion:

source: དེ་ལ་ཐུབ་དབང་འགྱུར་བ་གདོན་མི་འཚལ།
en: Lord of sages, I have no doubt in you.

source: །ཁྱོད་ཀྱི་ཞབས་ཀྱིས་བཅགས་པའི་ས་རྣམས་ཀྱང་།
en: ‘The ground upon which you have trod

source: །དྲི་མེད་རིན་ཆེན་འོད་དུ་གནས་པ་ལས།
en: Has become stainless with the light of jewels. You are adorned with the signs, and there is no doubt

source: །ཁམས་གསུམ་ཀུན་ཏུ་འཁོར་ལོས་སྒྱུར་བར་ཡང་། །མཚན་རབ་ཡོངས་ཀྱིས་བརྒྱན་བྱོན་གདོན་མི་འཚལ།
en: That you will be a cakravartin in all three realms.

source: །བདག་གིས་གཡར་ལམ་མཐོང་བ་དགུང་ཞིག་ལ། །ཆོས་བཟང་སྤྲིན་འོད་བྱང་ཆུབ་སྙིང་པོ་ཡི།
en: ‘I have seen in a dream

source: །ཤིང་དབང་དྲུང་ན་དེ་བཞིན་གཤེགས་པ་བཞུགས།
en: A tathāgata at the foot of the lord of trees At the bodhimaṇḍa Sudharma­megha­prabhā,

source: །སངས་རྒྱས་སྲས་མང་དུ་མས་མདུན་དུ་བདར།
en: With many sons of the buddhas before him.

source: །རྒྱལ་པའི་དབང་པོ་སྐུ་མཆོག་ཉི་མ་དེ།
en: ‘Sūrya­gātra­pravara, lord of jinas,

source: །འཛམ་བུ་ཆུ་ཀླུང་རིན་ཆེན་འཚེར་བ་འདྲ།
en: Shining like precious Jambu River gold—

source: །གཡར་ལམ་མཐོང་བར་ཕྱག་གིས་བདག་མགོ་བྱུག །དེ་ནས་སང་ནས་གློ་བ་རབ་ཏུ་དགའ།
en: I saw him in a dream stroking my head,

source: །དགའ་བའི་འོད་ཅེས་བགྱི་བ་རྣམ་དག་ལུས།
en: And so today was filled with joy. “ ‘A goddess with a pure body

source: །སྔན་ཆད་གཉེན་བཤེས་གྱུར་པའི་ལྷ་མོ་ཡིས།
en: Named Ratiprabhā, a relative in the past,

source: །བདག་ལ་བསྟན་པ་བདེ་གཤེགས་དེ་ཉིད་ནི།
en: Proclaimed to me that this tathāgata

source: །སྙིང་པོ་ཡང་དག་བྱང་ཆུབ་ཡོངས་ལ་ཞུགས།
en: Was present at the bodhimaṇḍa. “ ‘Before that I developed the aspiration

source: །སྔོན་ཡང་གཞོན་ནུ་གཟི་བརྗིད་ཁྱོད་བལྟ་ཞེས། །བདག་གི་སེམས་བསྐྱེད་དེ་ལྟར་བསམ་པར་གྱུར།
en: Of thinking I shall see you, Prince Tejodhipati.

source: །མདང་སུམ་དགུང་ལ་ལྷ་མོ་དགེ་བ་ཡིས།
en: The goddess proclaimed to me,

source: །གཞོན་ནུ་དེ་ནི་མཐོང་བར་འགྱུར་ཞེས་བསྟན།
en: “You will see that prince today!”

source: །བདག་གི་བདེ་གཤེགས་གཡར་ལམ་རྨྱིས་པས་མཐོང་།
en: ‘I dreamed of seeing the sugata,

source: །ཡོངས་སུ་དག་པའི་སེམས་ཅན་ཁྱོད་ཀྱང་མཐོང་།
en: And I also saw you, a pure being.

source: །ཡིད་བཞིན་བསམ་གྲུབ་ཁྱོད་དང་བདག་བཅས་པས།
en: You, a wish-fulfilling jewel, and I

source: །དེ་རིང་རྒྱལ་བ་དེ་ལ་མཆོད་པར་བགྱི།
en: Will today make offerings to that jina.’

source: །དེ་ནས་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོས། དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་མཚན་ཐོས་ཏེ། སངས་རྒྱས་བལྟ་བའི་སྐབས་བྱུང་ནས་དགའ་བ་དང་མོས་པའི་ཤུགས་ཆེན་པོ་སྐྱེས་ཏེ།
en: “Then Prince Tejodhipati, on hearing the name of the Tathāgata Sūrya­gātra­pravara, developed a powerful great aspiration and joy on having gained the opportunity to see that buddha.

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་ནོར་བུ་རིན་པོ་ཆེ་ལྔ་བརྒྱས་མངོན་བར་གཏོར་ནས། གཙུག་གི་རིན་པོ་ཆེ་དཔལ་གྱི་འོད་འབར་བ་ཞེས་བྱ་བ་ཡང་དེ་ལ་བྱིན་ནོ། །མྱེའི་མདོག་ལྟར་འདུག་པའི་ནོར་བུ་རིན་པོ་ཆེ་དམ་པས་བརྒྱན་པའི་གོས་རིན་པོ་ཆེས་ཀྱང་དེ་བཀབ་པོ།
en: He scattered five hundred jewels on the girl Sucalita­rati­prabhāsa­śrī, gave her his crest jewel called glorious shining light , and covered her with precious clothing the color of fire and adorned her with excellent precious jewels.

source: །དེ་དེ་ལྟར་རིམ་གྲོར་བྱས་ཀྱང་དགའ་བར་གྱུར་པའམ། །ཉམས་བདེ་བར་གྱུར་པ་ལྟ་བུའང་མེད་ལ་དགའ་བ་དང་མོས་པར་ཡང་མ་གྱུར་གྱི། གཞན་དུ་ན་ཐལ་མོ་སྦྱར་ཅིང་མྱིག་མི་འགེབས་པར་གཞོན་ནུ་གཟི་བརྗིད་བདག་གི་གདོང་ལ་བལྟ་ཞིང་གནས་བར་གྱུར་ཏོ། །དེ་ནས་སྦྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པས།
en: “Though she was honored in that way, she did not delight or rejoice in it or become overjoyed, but with her hands together in homage remained gazing with her eyes fixed upon the face of Prince Tejodhipati.

source: རྒྱལ་བ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then Sudarśanā, the preeminent courtesan, recited these verses to Prince Tejodhipati: “ ‘I have, for a long time, been thinking

source: །བུ་མོ་འདི་ནི་ཁྱོད་གསལ་བགྱི་སྙམ་ནས། །ཡུན་རིང་སྔ་ནས་བདག་གིས་བསམ་བསམ་སྟེ།
en: That I will give you this daughter of mine.

source: །གཟུགས་མཛེས་དེ་ཡང་དེ་རིང་ཁྱོད་ལ་ཕུལ།
en: Today I give you this one who has a beautiful body

source: །བསོད་ནམས་ལེགས་བརྒྱན་ཡོན་ཏན་རབ་དང་ལྡན།
en: Adorned by excellent merits and possessing excellent qualities. “ ‘You will not find in the human world

source: །ཚུལ་ཁྲིམས་བློ་དང་ཡོན་ཏན་གཞན་གྱིས་ཀྱང་། །བུ་མོ་དམ་པ་འདི་དང་འདྲ་བ་ནི།
en: Another excellent girl who is like this. She has a mind of good conduct and other qualities.

source: །མི་ཡི་འཇིག་རྟེན་གང་ནའང་མ་མཆིས་ཏེ།
en: She is the best woman in all the world.

source: །འཇིག་རྟེན་ཀུན་གྱི་བུད་མེད་ནང་ན་མཆོག །པད་མོའི་སྦུབས་ནས་སྐྱེས་པས་རིགས་སྨོས་སུ།
en: ‘Her birth was emergence from within a lotus.

source: །སྐྱོན་གྱི་དྲི་མས་མ་གོས་འཐད་མ་ལགས།
en: She is worthy, unstained by vices.

source: །མ་ལུས་སྐྱོན་གྱིས་མ་གོས་སེམས་དང་ལྡན།
en: Her mind is unblemished by any fault.

source: །རྟག་པར་ཁྱོད་ཀྱི་སྤྱོད་ཚུལ་མཐུན་པར་འགྱུར།
en: Her conduct will always be in harmony with you.

source: །རེག་ན་བདེ་ལ་ཀུན་ནས་འཕགས་པས་ན།
en: ‘To touch her is blissful, superior to all.

source: །འདི་ཡི་ལུས་ནི་ཤིན་ཏུ་འཇམ་པ་སྟེ།
en: Her body has a perfect smoothness.

source: །བྲོ་འཚལ་ནད་པ་གང་ལ་རེག་གྱུར་ཀྱང་།
en: Sick people who touch her

source: །དེའི་མོད་ལ་བྲོ་དང་བྲལ་བར་འགྱུར།
en: Instantly become healthy.

source: །འདིའི་ལུས་ལས་སྤོས་ཀྱི་ངད་འབྱུང་བ།
en: ‘Her body exudes the aroma of perfume

source: །སྤོས་མཆོག་གཞན་རྣམས་མངོན་པར་ཟིལ་གྱིས་གནོན།
en: So perfect it overshadows all other perfumes.

source: །དེ་ཡི་དྲི་ཞིམ་མ་ཚོར་ན་རྣམ་དག་པའི།
en: All people who smell her lovely aroma

source: །ཚུལ་ཁྲིམས་གནས་པར་མི་རྣམས་ཀུན་ཀྱང་འགྱུར།
en: Are established in pure, correct conduct.

source: །འདི་ཡི་ལུས་ནི་གསེར་གྱི་མདོག་འདྲ་སྟེ།
en: ‘Her body is like the color of gold

source: །པད་མོའི་མཆོག་ལྟར་རྣམ་པར་རབ་ཏུ་གསལ།
en: And shines like the best of lotuses. All angry beings without exception

source: །ཁྲོས་པས་བལྟས་ན་བྱམས་པའི་སེམས་ལྡན་པར། སེམས་ཅན་མ་ལུས་ཀུན་ཀྱང་རབ་ཏུ་འགྱུར།
en: Become loving on seeing her.

source: །འདི་ཡི་ཚིག་སྙན་ཡིད་དུ་འོང་བ་སྟེ།
en: ‘Her speech is sweet, beautiful, and charming

source: །ཉམས་སུ་བདེ་བས་འགྲོ་བ་ཉན་པར་དགའ།
en: So that it is a delight for beings to listen to.

source: །ཐོས་ན་དེ་རྒྱུས་སྐྱོན་གྱི་མུན་པ་དང་། །མི་དགེའི་སུག་ལས་བགྱིད་པར་མོས་མི་འགྱུར།
en: Hearing it dispels the darkness of faults And causes there to be no wish to do bad actions.

source: །འདི་ནི་བསམ་དག་ཡིད་ལ་དྲི་མེད་དེ།
en: ‘She has pure motivation and a stainless mind.

source: །འདི་ལ་ཀུན་ཏུ་གཡོ་དང་སྒྱུ་མ་མཆིས།
en: She never has any deception or trickery.

source: །ཇི་སྨྲ་དེ་དག་ཡིད་ལའང་དེ་བཞིན་ཏེ།
en: Whatever she says, that is what is in her mind,

source: །ཚིག་དབྱངས་དེས་ནི་འགྲོ་བ་ཚིམ་པར་བགྱིད།
en: And with her words she brings contentment to beings.

source: །སྒྱུ་ཡིས་སེམས་ཅན་འདྲིད་པར་མི་འགྱིད་དེ།
en: ‘She does not deceive beings through trickery.

source: །ནོར་གྱི་དོན་དུ་འགྲོ་བ་ཡོངས་མི་སླུ།
en: She does not deceive beings for the sake of wealth.

source: །ཡིད་བསྡམས་ཁྲེལ་གྱིས་འཛེམ་དང་ལྡན་པ་སྟེ།
en: She has a sense of decorum and controls her mind,

source: །རྒན་ནམ་གཞོན་ལའང་རྟག་ཏུ་སྲིད་ཞུས་སྤྱོད།
en: And she is always respectful to the young and the old.

source: །རིགས་རྒྱུད་གཟུགས་ཀྱིས་དྲེགས་པ་མ་མཆིས་ཏེ།
en: ‘She is not haughty because of birth, class, or body.

source: །འདི་ནི་འཁོར་གྱིས་དྲེགས་པའང་ཡོད་མ་མཆིས།
en: She is not haughty because of her entourage.

source: །ང་རྒྱལ་རློམ་སེམས་ཡོངས་དང་བྲལ་བ་སྟེ།
en: She is free of pride and arrogance

source: །འགྲོ་བ་རྣམས་ལ་རྟག་ཏུ་གུས་པར་འདུད།
en: And always bows respectfully to beings.’

source: །དེ་ནས་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་འཁོར་དང་བཅས་པ་དང་། བུ་མོ་སྟོང་ཕྲག་ཉི་ཤུ་དང་། འཁོར་ཐམས་ཅད་དང་བཅས་པར་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ནས་འོད་ཀྱི་སྤྲིན་འབྱུང་བ་དེ་ནས་བྱུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱིས་འཕགས་པའི་འོད་གང་ན་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་གང་ན་བ་དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་ཞལ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་འཚལ་བ་དང་། མཆོད་པ་དང་བསྟེན་བཀུར་བྱ་བའི་ཕྱིར་དོང་སྟེ། །དེ་རྟ་བབས་སའི་བར་དུ་བཞོན་པས་སོང་ནས་བབས་ཏེ་རྐང་པས།
en: “Then Prince Tejodhipati, accompanied by the girl Sucalita­rati­prabhāsa­śrī and her entourage, and by his entourage of twenty thousand maidens, left Gandhāṅkura­śikhara­prabha­meghā Park and went to the Dharmodgata­prabhāsa bodhimaṇḍa, where the Bhagavat, the Tathāgata Sūrya­gātra­pravara, was, in order to gaze upon the Bhagavat, the Tathāgata Sūrya­gātra­pravara, bow down to him, make offerings to him, and honor him.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་དྲུང་དུ་སོང་ངོ་། །དེ་ནས་རྒྱལ་པོའི་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོས་རྒྱང་རིང་ཞིག་ནས།
en: “They rode as far as the gateway and then proceeded on foot to come into the presence of the Bhagavat, the Tathāgata Sūrya­gātra­pravara.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རབ་ཏུ་བཟང་བ་བལྟ་ན་སྡུག་པ་དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ། དབང་པོ་བསྡམས་པ། གླང་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ། མཚོ་ལྟར་དང་ཞིང་རྙོག་པ་མེད་ལ་རྣམ་པར་གསལ་བ་མཐོང་ངོ་། །དེ་ལྟར་མཐོང་ནས་དེའི་སེམས་མངོན་བར་མོས་པར་གྱུར་ཏེ།
en: “Prince Tejodhipati saw from afar that the Tathāgata Arhat Samyak­saṃbuddha Sūrya­gātra­pravara was attractive, handsome, with pacified senses, with a pacified mind, with restrained senses, as tamed as an elephant, and as clear, undefiled, and serene as a lake.

source: དེ་ལྟར་སེམས་མངོན་པར་མོས་པར་གྱུར་ནས་སངས་རྒྱས་མཐོང་བའི་དགའ་བ་དང་། མོས་པའི་ཤུགས་ཆེན་པོ་རྣམ་པར་སྤེལ་དེ་དགའ་བ་དང་མོས་པ་དང་། སྤྲོ་པ་ཆེན་པོས་ཡོངས་སུ་རྒྱས་པའི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་སྩོགས་པ་འཁོར་ཐམས་ཅད་དང་བཅས་པས།
en: “On seeing him in that way, Prince Tejodhipati was attracted to him, and with his mind attracted to him, there increased within him the power of great faith and joy on seeing the Buddha. With that increasing joy, faith, and attraction, he circumambulated the Bhagavat, keeping him to his right, many hundreds of thousands of times. “The girl Sucalita­rati­prabhāsa­śrī and the rest of the entourages bowed their heads to the Bhagavat’s feet and scattered five hundred thousand lotuses made of excellent jewels over the Bhagavat.

source: བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། རིན་པོ་ཆེ་དམ་པའི་པད་མོ་སྟོང་ཕྲག་ལྔ་བརྒྱས་བཅོམ་ལྡན་འདས་དེ་ལ་མངོན་པར་གཏོར་ཏེ། བཅོམ་ལྡན་འདས་དེའི་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྤོས་སྣ་ཚོགས་ལས་བྱས་པ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: They built for the Bhagavat five hundred vihāras made from various aromatic materials and kings of jewels and adorned by various kings of jewels.

source: ལྔ་བརྒྱ་བརྩིགས་སོ། །གཙུག་ལག་ཁང་རེ་རེ་ཞིང་ཡང་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྟོང་ཕྲག་ལྔ་བརྒྱས་རབ་ཏུ་བརྒྱན་ཏོ།
en: Each vihāra was adorned by five thousand kings of precious jewels.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པས་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་མདོ་སྡེ་སྒོ་ཀུན་ཏུ་ལྟ་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཡང་དག་པར་བསྟན་ཏོ།
en: “Then the Bhagavat, the Tathāgata Sūrya­gātra­pravara, knowing the thoughts of Prince Tejodhipati, taught the sūtra called The Lamp for Seeing All Entrances

source: །དེས་དེ་ཐོས་ནས་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་ཕྲག་བཅུ་ཐོབ་པར་གྱུར་ཏེ།
en: “When Prince Tejodhipati heard that, he attained ten oceans of samādhis of the ways of all Dharmas.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་ཡང་དག་པར་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་བོ།
en: They were like this: “He attained the gateway of the samādhi called the arising of an ocean of prayers of all the tathāgatas

source: །དུས་གསུམ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་བོ།
en: “He attained the gateway of the samādhi called the essence of the appearances of the three times

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་མངོན་དུ་གྱུར་བར་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོར་རབ་ཏུ་ཐོབ་པོ།
en: “He attained the gateway of the samādhi called the arising of the manifestation of the fields of all the buddhas

source: །སེམས་ཅན་འབྱམ་ཀླས་པ་ཐམས་ཅད་རབ་ཏུ་སྣང་བར་བྱ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ།
en: “He attained the gateway of the samādhi called entering the illumination of the entire vast extent of being

source: །འཇིག་རྟེན་ཐམས་ཅད་དུ་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ལ་ཞུགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ།
en: “He attained the gateway of the samādhi called entering the illumination of wisdom that arises in all worlds

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ལ་འཇུག་པ་སྣང་བའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་བོ།
en: “He attained the gateway of the samādhi called the lamp that illuminates the entry into the ocean of the faculties of all beings

source: །འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཡེ་ཤེས་ཀྱི་སྤྲིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ།
en: “He attained the gateway of the samādhi called the cloud of wisdom that protects all beings

source: །འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་མངོན་དུ་གྱུར་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ།
en: “He attained the gateway of the samādhi called the lamp that manifests the ripening and guiding of all beings

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་རྣམས་དམྱིགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་པོ།
en: “He attained the gateway of the samādhi called the perception of the words of the Dharma wheels of all tathāgatas

source: །ཀུན་ཏུ་བཟང་བོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པར་བྱེད་པའི་སྨོན་ལམ་གྱི་སྤྲིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རབ་ཏུ་ཐོབ་སྟེ།
en: “He attained the gateway of the samādhi called the cloud of the prayers that purify the field of completely good conduct

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་བཅུ་པོ་འདི་དག་ལ་སྩོགས་བ་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་ཕྲག་བཅུ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: “He attained those ten samādhi gateways and so on, a further ten oceans of gateways to samādhis in all the ways of the Dharma.

source: །བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས་ཀྱང་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བའི་སེམས་ངེས་པར་གཞག་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: “Also, the girl Sucalita­rati­prabhāsa­śrī attained the realization called the essence of the ocean of the wisdom that is difficult to accomplish and became irreversible in her progress to the highest, complete enlightenment.

source: །དེ་ནས་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་དང་། འཁོར་ཐམས་ཅད་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔ་ནས་དོང་ངོ་།
en: “Then Prince Tejodhipati bowed his head to the feet of the Bhagavat, the Tathāgata Sūrya­gātra­pravara and circumambulated the Bhagavat many hundreds of thousands of times, keeping him to his right, and then, together with the girl Sucalita­rati­prabhāsa­śrī and his entourage, he departed from the presence of the Bhagavat.

source: །དེ་ནས་རྒྱལ་པོའི་གནས་སྡོང་བོ་རི་བོའི་དཔལ་གང་ན་བ་དང་། རྒྱལ་པོ་ཡབ་ནོར་གྱི་བདག་པོ་གང་ན་བ་དེར་དོང་སྟེ།
en: “He went to the royal capital Druma­meru­śrī and to his father King Dhanapati.

source: དྲུང་དུ་ཕྱིན་ནས། རྒྱལ་པོ་ཡབ་ནོར་གྱི་བདག་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དོན་འདི་བརྗོད་དོ། །ལྷའི་ཞལ་སྔ་ནས་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: He came into his presence, bowed his head to the feet of King Dhanapati, and said, ‘Your Majesty, I request that you heed me.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐུ་ཉི་མ་དམ་པ་ཞེས་བགྱི་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བ་ཁ་ལོ་བསྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: There has appeared in the world a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, named Sūrya­gātra­pravara.

source: ཁྱོད་ཀྱི་ཁམས་འདི་ཉིད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱི་སྤྲིན་ཤིན་ཏུ་སྡུག་པའི་འོད་ན་རྣམ་པར་སྤྱོད་དེ།
en: He is dwelling in your realm’s bodhimaṇḍa called Dharma­meghodgata­prabhā.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལགས་སོ།
en: It is not long since he attained complete buddhahood.’

source: །དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོས། གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་ཁྱོད་ལ་དོན་འདི་ལྷ་འམ་མི་འམ་སུ་ཞིག་གི་སྦྲན།
en: “Then King Dhanapati said to Prince Tejodhipati, ‘Prince, did a deity or a human tell you about this?’

source: དེས་སྨྲས་པ། བདག་ལ་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས་སྦྲན་ཏོ།
en: “He replied, ‘A girl named Sucalita­rati­prabhāsa­śrī told me.’

source: །དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོས་སངས་རྒྱས་བྱུང་བར་ཐོས་ནས། སངས་རྒྱས་སྐྱེ་བ་ལ་ནི་གཏེར་རབ་ཏུ་ཐོབ་ཙམ་དུ་སེམས།
en: “Then King Dhanapati, having heard that a buddha had appeared, thought how he had obtained the treasure of the birth of a buddha.

source: སངས་རྒྱས་རིན་པོ་ཆེ་དང་ཕྲད་པར་ནི་དཀའ་བར་སེམས།
en: He thought how it was difficult to meet a precious buddha.

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བས་ནི་ངན་སོང་གི་གཡང་སའི་འཇིགས་པ་ཐམས་ཅད་ཀྱང་རྣམ་པར་ལྡོག་པར་སེམས།
en: He thought how seeing a tathāgata dispels the danger of the abyss of the lower existences.

source: ཉོན་མོངས་པའི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་ནི་སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་དང་ཕྲད་པ་ཙམ་དུ་སེམས།
en: He thought how it was like encountering a great king of medicines that cures the great illness of the kleśas.

source: འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ནི་ཡོངས་སུ་འགྲེལ་བ་ཡིན་པར་སེམས།
en: He thought how this liberates from all the sufferings of saṃsāra.

source: ཤིན་ཏུ་བདེ་ཞིང་ལྡན་པ་ལ་ནི་རབ་ཏུ་གཞོག་པར་སེམས། རབ་རིབ་མེད་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ནི་ཡང་དག་པར་སྟོན་པར་སེམས།
en: He thought how this establishes one in perfect happiness.

source: མ་རིག་པའི་མུན་པ་བསྩལ་བ་ལ་ནི་སྒྲོན་མ་ཆེན་པོ་བྱུང་བ་ཙམ་དུ་སེམས།
en: He thought how this is a great lamp that eliminates the darkness of ignorance.

source: འཇིག་རྟེན་མགོན་མེད་པ་ལས་ནི་ཆོས་ཀྱི་ཚུལ་གྱི་མགོན་དང་ཕྲད་པར་སེམས།
en: He thought how this is like obtaining a protector in the way of the Dharma for a world that has no protector.

source: འཇིག་རྟེན་འདྲེན་པ་མེད་པ་ལས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཐེག་པས་འདྲེན་པ་སྐྱེས་པར་སེམས་ཤིང་སངས་རྒྱས་བྱུང་བར་ཐོས་པས་མོས་པ་དང་། སྤྲོ་བ་ཆེན་པོ་སྐྱེས་ནས་རྒྱལ་རིགས་དང་བྲམ་ཟེ་དག་ལྗོངས་ཀྱི་མི་དང་། ཡུལ་གྱི་མི་དང་། བློན་པོ་དང་ཞམ་རིང་བ་དང་། གཞོན་ནུ་དང་རྒྱལ་ཕྲན་དང་། ཁམས་ཀྱི་བདག་པོ་དང་། འཁོར་ཐམས་ཅད་ཀྱང་ཀུན་ནས་བསྡུས་ནས།
en: He thought how this is the appearance of a guide through the yāna of omniscience for a world that has no guide. On hearing that a buddha had appeared, he felt great joy and faith. “He gathered together all the kṣatriyas, the brahmins, the townspeople, the country people, the ministers, the court priests, the princes, the local governors, the guardians, and the court.

source: སངས་རྒྱས་བྱུང་བར་སྒྲ་སྙན་པ་སྒྲོག་པའི་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་རྒྱལ་པོའི་སྲིད་དེ་ཡང་ཆོས་ཀྱི་དགབ་བར་བྱིན་ནོ། །དེ་ལྟར་གཞོན་ནུ་དེ་རྒྱལ་སྲིད་ལ་དབང་བསྐུར་ནས།
en: He bestowed the kingdom and the protection of the Dharma on Prince Tejodhipati, who had announced the appearance of the buddha.

source: སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་དང་ལྷན་ཅིག་ཏུ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: “Having anointed him as the sovereign, he went together with two thousand people to where the Bhagavat, the Tathāgata Sūrya­gātra­pravara was.

source: སྤྱན་སྔར་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་རང་གི་འཁོར་དང་བཅས་ཏེ་འཁོད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པས།
en: Having come into his presence, he bowed his head to the Bhagavat’s feet, circumambulated the Bhagavat, keeping him to his right, many hundreds of thousands of times, and then sat with his entourage before the Bhagavat.

source: རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་གཟིགས་ནས།
en: “The Bhagavat Sūrya­gātra­pravara looked at King Dhanapati and all his entourage.

source: དེའི་ཚེ་མཛོད་སྤུ་ནས་འོད་གཟེར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བ་རབ་ཏུ་བཀྱེའོ།
en: At that time his ūrṇā hair radiated a light ray called a lamp for the minds of all beings

source: །དེས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བར་བྱས་ཏེ། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་མངོན་སུམ་དུ་བཀོད་ནས། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་ཏེ། སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་རྣམ་པར་སྦྱངས་ནས།
en: It illuminated the world realms in the ten directions and came before all the lords of the worlds, manifested countless buddha miracles, and purified the thoughts and higher motivations of the beings who were being guided by the buddhas.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་བསམ་གྱིས་མི་ཁྱབ་པའི་མཐུས་སངས་རྒྱས་ཀྱི་སྐུ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ཐམས་ཅད་དང་ལྡན་པས། གཟུངས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་པའི་དོན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་གཟུངས་ཀྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་བཅས་པར་ཡང་དག་པར་བསྟན་ཏོ།
en: “At that time, through the inconceivable blessing of the buddha, and through possessing a buddha’s body higher than all worlds, and through the entire ocean of the aspects of the voice of a buddha, he taught the dhāraṇī gateway called the lamp of the meaning of all the Dharmas freed from darkness , together with dhāraṇī gateways as numerous as the atoms in a buddha realm.

source: །དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོས་གཟུངས་ཀྱི་སྒོ་དེ་ཐོས་ནས་ཆོས་ཐམས་ཅད་ལ་ཆས་ཀྱི་སྣང་བ་ཆེན་པོ་སྐྱེས་པར་གྱུར་ཏོ།
en: “Then King Dhanapati, having heard that dhāraṇī gateway, generated a great Dharma illumination of all Dharmas.

source: །འཁོར་དེའི་བྱང་ཆུབ་སེམས་དཔལ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀྱང་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་པའི་དོན་གྱི་སྒྲོན་མའི་གཟུངས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: “The bodhisattvas in that assembly, who were as numerous as the atoms in Jambudvīpa, also attained the dhāraṇī gateway called the lamp of the meaning of all the Dharmas freed from darkness

source: །ཁྲག་ཁྲིག་དྲུག་ཅུས་ནི་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་ཅན་རྣམ་པར་གྲོལ་ལོ། །སྲོག་ཆགས་སྟོང་ཕྲག་བཅུས་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པར་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: Sixty hundred thousand million beings had their minds liberated from defilements, without grasping. Ten thousand beings gained a stainless, pure, unclouded Dharma vision of all Dharmas.

source: །སེམས་ཅན་གྲངས་མེད་པ་ཞིག་གིས་ནི་སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཡོངས་སུ་བསྐྱེད་དོ།
en: Countless beings who had not previously developed the aspiration for the highest, complete enlightenment developed that aspiration.
